# T = int(input())

# dx = [0, 1, 0, -1] #방향
# dy = [1, 0, -1, 0] #방향

# for t in range(T):
#     N = int(input()) #배열 N*N
#     num = []
#     A = 1
#     for n in range(N):
#         num.insert(0 ,[])
    
#     for i in range(N-1):
              
'''
--------------------------------------------------
'''

    
#     end = 0
#     for n in range(N)
#         if end < N:
#             num.append(num+1)
#             print(num)
#             end=+1

'''
1시간반동안 풀다가 안돼서 gpt 힌트로 
dx = [0, 1, 0, -1] #방향
dy = [1, 0, -1, 0] #방향
이거 받았는데도 못했습니다ㅠ

##시간은 문제 푸는 방식을 찾느라 시간이 오래걸렸습니다.(약 2시간 20분)
1. 특정 열 선택(구글)
1. 2차원 배열 공간 만들기
2. 문제 푸는 방식(예상)
     
     for i in range(N-1) // N-1번 반복
        for j in range(?) // *3,*2 반복
            이동 횟수 A = 1이고 쉼표 기준 1씩 증가  
            (N-A)*3, (N-A)*2, (N-A)*2, ~ (N-A)가 0이 되기 전까지 
            식 한번 실행될 때마다 방향바꾸면서 반복 = 총 N-1번 반복함.  
'''